``` Terraform will perform the following actions:

  # aws_route53_record.usegalaxy_eu_forwardmail_validation_txt will be created
  + resource "aws_route53_record" "usegalaxy_eu_forwardmail_validation_txt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "forward-email-site-verification=XS8hOkR5lO",
        ]
      + ttl             = 3600
      + type            = "TXT"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.usegalaxy_eu_spf_txt must be replaced
-/+ resource "aws_route53_record" "usegalaxy_eu_spf_txt" {
      ~ fqdn            = "usegalaxy.eu" -> (known after apply)
      ~ id              = "Z1C7L7XFF9613J__TXT" -> (known after apply)
      + name            = "@" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_volume_attach_v2.influxdb-va will be created
  + resource "openstack_compute_volume_attach_v2" "influxdb-va" {
      + device      = "/dev/vdb"
      + id          = (known after apply)
      + instance_id = "44acd556-0be5-4705-aad8-9d5276d4b6b9"
      + region      = (known after apply)
      + volume_id   = "f6e77471-9180-4055-941f-b18fe353571c"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```